loadtest/results/01-onboarding.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /root/Mento/loadtest/k6/01-onboarding.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m0s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 2m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 02/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/50 VUs  0m01.0s/2m30.0s

running (0m02.0s), 04/50 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 04/50 VUs  0m02.0s/2m30.0s

running (0m03.0s), 05/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 05/50 VUs  0m03.0s/2m30.0s

running (0m04.0s), 07/50 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 07/50 VUs  0m04.0s/2m30.0s

running (0m05.0s), 09/50 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 09/50 VUs  0m05.0s/2m30.0s

running (0m06.0s), 10/50 VUs, 4 complete and 0 interrupted iterations
default   [   4% ] 10/50 VUs  0m06.0s/2m30.0s

running (0m07.0s), 12/50 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 12/50 VUs  0m07.0s/2m30.0s

running (0m08.0s), 14/50 VUs, 7 complete and 0 interrupted iterations
default   [   5% ] 14/50 VUs  0m08.0s/2m30.0s

running (0m09.0s), 15/50 VUs, 9 complete and 0 interrupted iterations
default   [   6% ] 15/50 VUs  0m09.0s/2m30.0s

running (0m10.0s), 17/50 VUs, 13 complete and 0 interrupted iterations
default   [   7% ] 17/50 VUs  0m10.0s/2m30.0s

running (0m11.0s), 18/50 VUs, 17 complete and 0 interrupted iterations
default   [   7% ] 18/50 VUs  0m11.0s/2m30.0s

running (0m12.0s), 20/50 VUs, 20 complete and 0 interrupted iterations
default   [   8% ] 20/50 VUs  0m12.0s/2m30.0s

running (0m13.0s), 22/50 VUs, 21 complete and 0 interrupted iterations
default   [   9% ] 22/50 VUs  0m13.0s/2m30.0s

running (0m14.0s), 23/50 VUs, 25 complete and 0 interrupted iterations
default   [   9% ] 23/50 VUs  0m14.0s/2m30.0s

running (0m15.0s), 25/50 VUs, 33 complete and 0 interrupted iterations
default   [  10% ] 25/50 VUs  0m15.0s/2m30.0s

running (0m16.0s), 27/50 VUs, 37 complete and 0 interrupted iterations
default   [  11% ] 27/50 VUs  0m16.0s/2m30.0s

running (0m17.0s), 28/50 VUs, 42 complete and 0 interrupted iterations
default   [  11% ] 28/50 VUs  0m17.0s/2m30.0s

running (0m18.0s), 30/50 VUs, 43 complete and 0 interrupted iterations
default   [  12% ] 30/50 VUs  0m18.0s/2m30.0s

running (0m19.0s), 32/50 VUs, 47 complete and 0 interrupted iterations
default   [  13% ] 32/50 VUs  0m19.0s/2m30.0s

running (0m20.0s), 33/50 VUs, 48 complete and 0 interrupted iterations
default   [  13% ] 33/50 VUs  0m20.0s/2m30.0s

running (0m21.0s), 35/50 VUs, 54 complete and 0 interrupted iterations
default   [  14% ] 35/50 VUs  0m21.0s/2m30.0s

running (0m22.0s), 36/50 VUs, 70 complete and 0 interrupted iterations
default   [  15% ] 36/50 VUs  0m22.0s/2m30.0s

running (0m23.0s), 38/50 VUs, 70 complete and 0 interrupted iterations
default   [  15% ] 38/50 VUs  0m23.0s/2m30.0s

running (0m24.0s), 40/50 VUs, 74 complete and 0 interrupted iterations
default   [  16% ] 40/50 VUs  0m24.0s/2m30.0s

running (0m25.0s), 41/50 VUs, 80 complete and 0 interrupted iterations
default   [  17% ] 41/50 VUs  0m25.0s/2m30.0s

running (0m26.0s), 43/50 VUs, 80 complete and 0 interrupted iterations
default   [  17% ] 43/50 VUs  0m26.0s/2m30.0s

running (0m27.0s), 45/50 VUs, 81 complete and 0 interrupted iterations
default   [  18% ] 45/50 VUs  0m27.0s/2m30.0s

running (0m28.0s), 46/50 VUs, 81 complete and 0 interrupted iterations
default   [  19% ] 46/50 VUs  0m28.0s/2m30.0s

running (0m29.0s), 48/50 VUs, 81 complete and 0 interrupted iterations
default   [  19% ] 48/50 VUs  0m29.0s/2m30.0s

running (0m30.0s), 49/50 VUs, 95 complete and 0 interrupted iterations
default   [  20% ] 49/50 VUs  0m30.0s/2m30.0s

running (0m31.0s), 50/50 VUs, 106 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  0m31.0s/2m30.0s

running (0m32.0s), 50/50 VUs, 106 complete and 0 interrupted iterations
default   [  21% ] 50/50 VUs  0m32.0s/2m30.0s

running (0m33.0s), 50/50 VUs, 114 complete and 0 interrupted iterations
default   [  22% ] 50/50 VUs  0m33.0s/2m30.0s

running (0m34.0s), 50/50 VUs, 128 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  0m34.0s/2m30.0s

running (0m35.0s), 50/50 VUs, 128 complete and 0 interrupted iterations
default   [  23% ] 50/50 VUs  0m35.0s/2m30.0s

running (0m36.0s), 50/50 VUs, 128 complete and 0 interrupted iterations
default   [  24% ] 50/50 VUs  0m36.0s/2m30.0s

running (0m37.0s), 50/50 VUs, 128 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  0m37.0s/2m30.0s

running (0m38.0s), 50/50 VUs, 129 complete and 0 interrupted iterations
default   [  25% ] 50/50 VUs  0m38.0s/2m30.0s

running (0m39.0s), 50/50 VUs, 129 complete and 0 interrupted iterations
default   [  26% ] 50/50 VUs  0m39.0s/2m30.0s

running (0m40.0s), 50/50 VUs, 133 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  0m40.0s/2m30.0s

running (0m41.0s), 50/50 VUs, 164 complete and 0 interrupted iterations
default   [  27% ] 50/50 VUs  0m41.0s/2m30.0s

running (0m42.0s), 50/50 VUs, 165 complete and 0 interrupted iterations
default   [  28% ] 50/50 VUs  0m42.0s/2m30.0s

running (0m43.0s), 50/50 VUs, 165 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  0m43.0s/2m30.0s

running (0m44.0s), 50/50 VUs, 165 complete and 0 interrupted iterations
default   [  29% ] 50/50 VUs  0m44.0s/2m30.0s

running (0m45.0s), 50/50 VUs, 180 complete and 0 interrupted iterations
default   [  30% ] 50/50 VUs  0m45.0s/2m30.0s

running (0m46.0s), 50/50 VUs, 185 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m46.0s/2m30.0s

running (0m47.0s), 50/50 VUs, 186 complete and 0 interrupted iterations
default   [  31% ] 50/50 VUs  0m47.0s/2m30.0s

running (0m48.0s), 50/50 VUs, 201 complete and 0 interrupted iterations
default   [  32% ] 50/50 VUs  0m48.0s/2m30.0s

running (0m49.0s), 50/50 VUs, 201 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m49.0s/2m30.0s

running (0m50.0s), 50/50 VUs, 201 complete and 0 interrupted iterations
default   [  33% ] 50/50 VUs  0m50.0s/2m30.0s

running (0m51.0s), 50/50 VUs, 201 complete and 0 interrupted iterations
default   [  34% ] 50/50 VUs  0m51.0s/2m30.0s

running (0m52.0s), 50/50 VUs, 201 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  0m52.0s/2m30.0s

running (0m53.0s), 50/50 VUs, 236 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  0m53.0s/2m30.0s

running (0m54.0s), 50/50 VUs, 247 complete and 0 interrupted iterations
default   [  36% ] 50/50 VUs  0m54.0s/2m30.0s

running (0m55.0s), 50/50 VUs, 247 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  0m55.0s/2m30.0s

running (0m56.0s), 50/50 VUs, 262 complete and 0 interrupted iterations
default   [  37% ] 50/50 VUs  0m56.0s/2m30.0s

running (0m57.0s), 50/50 VUs, 262 complete and 0 interrupted iterations
default   [  38% ] 50/50 VUs  0m57.0s/2m30.0s

running (0m58.0s), 50/50 VUs, 262 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  0m58.0s/2m30.0s

running (0m59.0s), 50/50 VUs, 262 complete and 0 interrupted iterations
default   [  39% ] 50/50 VUs  0m59.0s/2m30.0s

running (1m00.0s), 50/50 VUs, 262 complete and 0 interrupted iterations
default   [  40% ] 50/50 VUs  1m00.0s/2m30.0s

running (1m01.0s), 50/50 VUs, 262 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m01.0s/2m30.0s

running (1m02.0s), 50/50 VUs, 262 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  1m02.0s/2m30.0s

running (1m03.0s), 50/50 VUs, 297 complete and 0 interrupted iterations
default   [  42% ] 50/50 VUs  1m03.0s/2m30.0s

running (1m04.0s), 50/50 VUs, 302 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m04.0s/2m30.0s

running (1m05.0s), 50/50 VUs, 302 complete and 0 interrupted iterations
default   [  43% ] 50/50 VUs  1m05.0s/2m30.0s

running (1m06.0s), 50/50 VUs, 317 complete and 0 interrupted iterations
default   [  44% ] 50/50 VUs  1m06.0s/2m30.0s

running (1m07.0s), 50/50 VUs, 317 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  1m07.0s/2m30.0s

running (1m08.0s), 50/50 VUs, 319 complete and 0 interrupted iterations
default   [  45% ] 50/50 VUs  1m08.0s/2m30.0s

running (1m09.0s), 50/50 VUs, 326 complete and 0 interrupted iterations
default   [  46% ] 50/50 VUs  1m09.0s/2m30.0s

running (1m10.0s), 50/50 VUs, 326 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m10.0s/2m30.0s

running (1m11.0s), 50/50 VUs, 326 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  1m11.0s/2m30.0s

running (1m12.0s), 50/50 VUs, 331 complete and 0 interrupted iterations
default   [  48% ] 50/50 VUs  1m12.0s/2m30.0s

running (1m13.0s), 50/50 VUs, 331 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m13.0s/2m30.0s

running (1m14.0s), 50/50 VUs, 367 complete and 0 interrupted iterations
default   [  49% ] 50/50 VUs  1m14.0s/2m30.0s

running (1m15.0s), 50/50 VUs, 387 complete and 0 interrupted iterations
default   [  50% ] 50/50 VUs  1m15.0s/2m30.0s

running (1m16.0s), 50/50 VUs, 387 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m16.0s/2m30.0s

running (1m17.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  51% ] 50/50 VUs  1m17.0s/2m30.0s

running (1m18.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  52% ] 50/50 VUs  1m18.0s/2m30.0s

running (1m19.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m19.0s/2m30.0s

running (1m20.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  1m20.0s/2m30.0s

running (1m21.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  54% ] 50/50 VUs  1m21.0s/2m30.0s

running (1m22.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  1m22.0s/2m30.0s

running (1m23.0s), 50/50 VUs, 401 complete and 0 interrupted iterations
default   [  55% ] 50/50 VUs  1m23.0s/2m30.0s

running (1m24.0s), 50/50 VUs, 437 complete and 0 interrupted iterations
default   [  56% ] 50/50 VUs  1m24.0s/2m30.0s

running (1m25.0s), 50/50 VUs, 443 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m25.0s/2m30.0s

running (1m26.0s), 50/50 VUs, 443 complete and 0 interrupted iterations
default   [  57% ] 50/50 VUs  1m26.0s/2m30.0s

running (1m27.0s), 50/50 VUs, 457 complete and 0 interrupted iterations
default   [  58% ] 50/50 VUs  1m27.0s/2m30.0s

running (1m28.0s), 50/50 VUs, 459 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m28.0s/2m30.0s

running (1m29.0s), 50/50 VUs, 459 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  1m29.0s/2m30.0s

running (1m30.0s), 50/50 VUs, 459 complete and 0 interrupted iterations
default   [  60% ] 50/50 VUs  1m30.0s/2m30.0s

running (1m31.0s), 50/50 VUs, 459 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m31.0s/2m30.0s

running (1m32.0s), 50/50 VUs, 459 complete and 0 interrupted iterations
default   [  61% ] 50/50 VUs  1m32.0s/2m30.0s

running (1m33.0s), 50/50 VUs, 464 complete and 0 interrupted iterations
default   [  62% ] 50/50 VUs  1m33.0s/2m30.0s

running (1m34.0s), 50/50 VUs, 493 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m34.0s/2m30.0s

running (1m35.0s), 50/50 VUs, 503 complete and 0 interrupted iterations
default   [  63% ] 50/50 VUs  1m35.0s/2m30.0s

running (1m36.0s), 50/50 VUs, 503 complete and 0 interrupted iterations
default   [  64% ] 50/50 VUs  1m36.0s/2m30.0s

running (1m37.0s), 50/50 VUs, 519 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  1m37.0s/2m30.0s

running (1m38.0s), 50/50 VUs, 519 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  1m38.0s/2m30.0s

running (1m39.0s), 50/50 VUs, 519 complete and 0 interrupted iterations
default   [  66% ] 50/50 VUs  1m39.0s/2m30.0s

running (1m40.0s), 50/50 VUs, 519 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  1m40.0s/2m30.0s

running (1m41.0s), 50/50 VUs, 519 complete and 0 interrupted iterations
default   [  67% ] 50/50 VUs  1m41.0s/2m30.0s

running (1m42.0s), 50/50 VUs, 519 complete and 0 interrupted iterations
default   [  68% ] 50/50 VUs  1m42.0s/2m30.0s

running (1m43.0s), 50/50 VUs, 519 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  1m43.0s/2m30.0s

running (1m44.0s), 50/50 VUs, 553 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  1m44.0s/2m30.0s

running (1m45.0s), 50/50 VUs, 557 complete and 0 interrupted iterations
default   [  70% ] 50/50 VUs  1m45.0s/2m30.0s

running (1m46.0s), 50/50 VUs, 557 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  1m46.0s/2m30.0s

running (1m47.0s), 50/50 VUs, 573 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  1m47.0s/2m30.0s

running (1m48.0s), 50/50 VUs, 577 complete and 0 interrupted iterations
default   [  72% ] 50/50 VUs  1m48.0s/2m30.0s

running (1m49.0s), 50/50 VUs, 577 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  1m49.0s/2m30.0s

running (1m50.0s), 50/50 VUs, 577 complete and 0 interrupted iterations
default   [  73% ] 50/50 VUs  1m50.0s/2m30.0s

running (1m51.0s), 50/50 VUs, 577 complete and 0 interrupted iterations
default   [  74% ] 50/50 VUs  1m51.0s/2m30.0s

running (1m52.0s), 50/50 VUs, 577 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  1m52.0s/2m30.0s

running (1m53.0s), 50/50 VUs, 578 complete and 0 interrupted iterations
default   [  75% ] 50/50 VUs  1m53.0s/2m30.0s

running (1m54.0s), 50/50 VUs, 607 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  1m54.0s/2m30.0s

running (1m55.0s), 50/50 VUs, 611 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  1m55.0s/2m30.0s

running (1m56.0s), 50/50 VUs, 611 complete and 0 interrupted iterations
default   [  77% ] 50/50 VUs  1m56.0s/2m30.0s

running (1m57.0s), 50/50 VUs, 631 complete and 0 interrupted iterations
default   [  78% ] 50/50 VUs  1m57.0s/2m30.0s

running (1m58.0s), 50/50 VUs, 631 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  1m58.0s/2m30.0s

running (1m59.0s), 50/50 VUs, 631 complete and 0 interrupted iterations
default   [  79% ] 50/50 VUs  1m59.0s/2m30.0s

running (2m00.0s), 50/50 VUs, 631 complete and 0 interrupted iterations
default   [  80% ] 50/50 VUs  2m00.0s/2m30.0s

running (2m01.0s), 50/50 VUs, 631 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m01.0s/2m30.0s

running (2m02.0s), 50/50 VUs, 631 complete and 0 interrupted iterations
default   [  81% ] 50/50 VUs  2m02.0s/2m30.0s

running (2m03.0s), 48/50 VUs, 661 complete and 0 interrupted iterations
default   [  82% ] 48/50 VUs  2m03.0s/2m30.0s

running (2m04.0s), 48/50 VUs, 661 complete and 0 interrupted iterations
default   [  83% ] 48/50 VUs  2m04.0s/2m30.0s

running (2m05.0s), 48/50 VUs, 661 complete and 0 interrupted iterations
default   [  83% ] 48/50 VUs  2m05.0s/2m30.0s

running (2m06.0s), 48/50 VUs, 661 complete and 0 interrupted iterations
default   [  84% ] 48/50 VUs  2m06.0s/2m30.0s

running (2m07.0s), 42/50 VUs, 685 complete and 0 interrupted iterations
default   [  85% ] 42/50 VUs  2m07.0s/2m30.0s

running (2m08.0s), 42/50 VUs, 685 complete and 0 interrupted iterations
default   [  85% ] 42/50 VUs  2m08.0s/2m30.0s

running (2m09.0s), 42/50 VUs, 685 complete and 0 interrupted iterations
default   [  86% ] 42/50 VUs  2m09.0s/2m30.0s

running (2m10.0s), 41/50 VUs, 694 complete and 0 interrupted iterations
default   [  87% ] 41/50 VUs  2m10.0s/2m30.0s

running (2m11.0s), 41/50 VUs, 694 complete and 0 interrupted iterations
default   [  87% ] 41/50 VUs  2m11.0s/2m30.0s

running (2m12.0s), 41/50 VUs, 694 complete and 0 interrupted iterations
default   [  88% ] 41/50 VUs  2m12.0s/2m30.0s

running (2m13.0s), 37/50 VUs, 709 complete and 0 interrupted iterations
default   [  89% ] 37/50 VUs  2m13.0s/2m30.0s

running (2m14.0s), 37/50 VUs, 709 complete and 0 interrupted iterations
default   [  89% ] 37/50 VUs  2m14.0s/2m30.0s

running (2m15.0s), 28/50 VUs, 727 complete and 0 interrupted iterations
default   [  90% ] 28/50 VUs  2m15.0s/2m30.0s

running (2m16.0s), 28/50 VUs, 727 complete and 0 interrupted iterations
default   [  91% ] 28/50 VUs  2m16.0s/2m30.0s

running (2m17.0s), 27/50 VUs, 735 complete and 0 interrupted iterations
default   [  91% ] 27/50 VUs  2m17.0s/2m30.0s

running (2m18.0s), 27/50 VUs, 735 complete and 0 interrupted iterations
default   [  92% ] 27/50 VUs  2m18.0s/2m30.0s

running (2m19.0s), 23/50 VUs, 746 complete and 0 interrupted iterations
default   [  93% ] 23/50 VUs  2m19.0s/2m30.0s

running (2m20.0s), 23/50 VUs, 747 complete and 0 interrupted iterations
default   [  93% ] 23/50 VUs  2m20.0s/2m30.0s

running (2m21.0s), 19/50 VUs, 755 complete and 0 interrupted iterations
default   [  94% ] 19/50 VUs  2m21.0s/2m30.0s

running (2m22.0s), 16/50 VUs, 762 complete and 0 interrupted iterations
default   [  95% ] 16/50 VUs  2m22.0s/2m30.0s

running (2m23.0s), 16/50 VUs, 762 complete and 0 interrupted iterations
default   [  95% ] 16/50 VUs  2m23.0s/2m30.0s

running (2m24.0s), 14/50 VUs, 770 complete and 0 interrupted iterations
default   [  96% ] 14/50 VUs  2m24.0s/2m30.0s

running (2m25.0s), 14/50 VUs, 770 complete and 0 interrupted iterations
default   [  97% ] 14/50 VUs  2m25.0s/2m30.0s

running (2m26.0s), 11/50 VUs, 774 complete and 0 interrupted iterations
default   [  97% ] 11/50 VUs  2m26.0s/2m30.0s

running (2m27.0s), 08/50 VUs, 778 complete and 0 interrupted iterations
default   [  98% ] 08/50 VUs  2m27.0s/2m30.0s

running (2m28.0s), 05/50 VUs, 784 complete and 0 interrupted iterations
default   [  99% ] 05/50 VUs  2m28.0s/2m30.0s

running (2m29.0s), 05/50 VUs, 784 complete and 0 interrupted iterations
default   [  99% ] 05/50 VUs  2m29.0s/2m30.0s

running (2m30.0s), 04/50 VUs, 785 complete and 0 interrupted iterations
default   [ 100% ] 04/50 VUs  2m30.0s/2m30.0s

running (2m31.0s), 03/50 VUs, 786 complete and 0 interrupted iterations
default ↓ [ 100% ] 04/50 VUs  2m30s

running (2m32.0s), 03/50 VUs, 786 complete and 0 interrupted iterations
default ↓ [ 100% ] 04/50 VUs  2m30s

     ✗ otp/request: status 200
      ↳  92% — ✓ 728 / ✗ 61
     ✗ otp/request: has devCode
      ↳  92% — ✓ 728 / ✗ 61
     ✗ otp/verify: status 200
      ↳  96% — ✓ 703 / ✗ 25
     ✗ otp/verify: has accessToken
      ↳  96% — ✓ 703 / ✗ 25
     ✗ onboarding/state: status 200
      ↳  96% — ✓ 678 / ✗ 25
     ✗ onboarding/state: has nextStep
      ↳  96% — ✓ 678 / ✗ 25
     ✗ onboarding/mirror: status 200
      ↳  0% — ✓ 0 / ✗ 703

     checks.............................: 82.01%  4218 out of 5143
     data_received......................: 3.8 MB  25 kB/s
     data_sent..........................: 1.0 MB  6.8 kB/s
     http_req_blocked...................: avg=20.71µs  min=2.07µs   med=5.8µs    max=14.02ms p(90)=9.51µs   p(95)=11.84µs 
     http_req_connecting................: avg=5.2µs    min=0s       med=0s       max=1.38ms  p(90)=0s       p(95)=0s      
     http_req_duration..................: avg=1.15s    min=771.9µs  med=666.36ms max=5.87s   p(90)=3.06s    p(95)=3.56s   
     ✗ { endpoint:auth_otp_request }....: avg=1.74s    min=33.82ms  med=2.1s     max=3.9s    p(90)=3.11s    p(95)=3.38s   
     ✗ { endpoint:auth_otp_verify }.....: avg=2.03s    min=11.45ms  med=1.73s    max=5.87s   p(90)=3.58s    p(95)=4.22s   
     ✗ { endpoint:onboarding_mirror }...: avg=461.01ms min=771.9µs  med=36.52ms  max=2.46s   p(90)=1.62s    p(95)=1.82s   
     ✗ { endpoint:onboarding_state }....: avg=295.55ms min=2.18ms   med=18.72ms  max=3.38s   p(90)=906.04ms p(95)=2.47s   
       { expected_response:true }.......: avg=1.44s    min=4.4ms    med=1.21s    max=5.87s   p(90)=3.23s    p(95)=3.58s   
     http_req_failed....................: 27.84%  814 out of 2923
     ✗ { endpoint:auth_otp_request }....: 7.73%   61 out of 789
     ✗ { endpoint:auth_otp_verify }.....: 3.43%   25 out of 728
     ✗ { endpoint:onboarding_mirror }...: 100.00% 703 out of 703
     http_req_receiving.................: avg=92.75µs  min=16.97µs  med=66.51µs  max=5.55ms  p(90)=133.54µs p(95)=183.66µs
     http_req_sending...................: avg=36.63µs  min=6.06µs   med=21.8µs   max=4.46ms  p(90)=48.15µs  p(95)=82.37µs 
     http_req_tls_handshaking...........: avg=0s       min=0s       med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...................: avg=1.15s    min=682.41µs med=666.23ms max=5.87s   p(90)=3.06s    p(95)=3.56s   
     http_reqs..........................: 2923    19.201416/s
     iteration_duration.................: avg=7.81s    min=1.03s    med=8.53s    max=12.24s  p(90)=10.44s   p(95)=10.79s  
     iterations.........................: 789     5.183003/s
     mirror_submit_duration.............: avg=461.19ms min=1ms      med=36ms     max=2.46s   p(90)=1.62s    p(95)=1.82s   
     otp_request_duration...............: avg=1.74s    min=34ms     med=2.1s     max=3.91s   p(90)=3.11s    p(95)=3.38s   
     otp_verify_duration................: avg=2.03s    min=12ms     med=1.74s    max=5.87s   p(90)=3.58s    p(95)=4.22s   
   ✗ signup_success_rate................: 0.00%   0 out of 789
     vus................................: 3       min=2            max=50
     vus_max............................: 50      min=50           max=50


running (2m32.2s), 00/50 VUs, 789 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  2m30s
time="2026-05-13T14:33:01Z" level=error msg="thresholds on metrics 'http_req_duration{endpoint:auth_otp_request}, http_req_duration{endpoint:auth_otp_verify}, http_req_duration{endpoint:onboarding_mirror}, http_req_duration{endpoint:onboarding_state}, http_req_failed{endpoint:auth_otp_request}, http_req_failed{endpoint:auth_otp_verify}, http_req_failed{endpoint:onboarding_mirror}, signup_success_rate' have been crossed"